import math

class Utils:
    """
    Κλάση βοηθητικών συναρτήσεων (static methods) για γεωμετρικές/μαθηματικές πράξεις.
    """

    @staticmethod
    def squared_distance(x1, y1, x2, y2):
        """
        Υπολογίζει την τετραγωνική Ευκλείδεια απόσταση μεταξύ δύο σημείων (x1, y1), (x2, y2).
        :param x1: Συντεταγμένη x του πρώτου σημείου.
        :param y1: Συντεταγμένη y του πρώτου σημείου.
        :param x2: Συντεταγμένη x του δεύτερου σημείου.
        :param y2: Συντεταγμένη y του δεύτερου σημείου.
        :return: Η τετραγωνική απόσταση (float).
        """
        return (x1 - x2) ** 2 + (y1 - y2) ** 2

    @staticmethod
    def mindist_squared(x, y, mbr):
        """
        Υπολογίζει την τετραγωνική ελάχιστη απόσταση μεταξύ ενός σημείου (x, y)
        και ενός MBR. Είναι η τετραγωνική απόσταση από το σημείο έως
        το πλησιέστερο σημείο του MBR (που μπορεί να είναι ένα άκρο ή μια γωνία).

        :param x: Συντεταγμένη x του σημείου.
        :param y: Συντεταγμένη y του σημείου.
        :param mbr: Ένα αντικείμενο MBR.
        :return: Η ελάχιστη τετραγωνική απόσταση (float).
        """
        dx = max(mbr.xmin - x, 0, x - mbr.xmax)
        dy = max(mbr.ymin - y, 0, y - mbr.ymax)
        return dx**2 + dy**2
